function s = Newton(x,y,t1,t2,z)
    m = length(x); %计算原数据点的维数
    n = length(t1); %计算新数据点的维数
    A = zeros(m+n,m+n+1); %构建空的差商表，列+1因为多一列原数据
    A(:,1) = [x;t1];  %把数据点的x值放入差商表的第一列
    A(:,2) = [y;t2];  %把数据点的y值放入差商表的第一列
    for j = 3:m+n+1   %一阶差商是从第三列开始计算的
        for i = 1:m+n
            if j <= i+1  %保证阶差商是在下三角
                A(i,j) = (A(i-1,j-1)-A(i,j-1))/(A(i+2-j,1)-A(i,1)); 
            end %计算差商表
        end
    end
    C = A(1:m+n,2:m+n+1); %去对角线，确定牛顿插值多项式的系数
    l = size(A,1);  %计算出预测点的维数
    s = C(1,1)*ones(length(z),1); %在牛顿插值多项式中，第一项常数可以先确定
    for u = 1:length(z) %从第一个预测点开始计算
        p = 1.0;        %初始化乘积p，连乘初始为1
        for k = 2:l     %牛顿插值多项式的非常数项从第二项开始
            p = p*(z(u)-A(k-1,1));  %p是连乘的项，即（x-xi）*
            s(u) = s(u)+C(k,k)*p;   %s（u）即最终插值多项式
        end
    end
    A  %返回A差商表
end
%返回最终预测向量s
